{
  "backend/main.mo": "Defines the main canister actor with user roles, profiles, vehicle tracking, routes, trips, alerts, and access-control‑based authorization helpers.",
  "backend/migration.mo": "Provides a no-op migration module that maps old actor state to the new state structure unchanged.",
  "feature_evidence.json": "Feature evidence file listing dashboard-related feature updates, associated frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated text summaries of key frontend components, dashboards, hooks, and services.",
  "frontend/index.css": "Tailwind CSS base/theme configuration defining color tokens and light/dark mode variables.",
  "frontend/index.html": "HTML entry point bootstrapping the frontend with a root div and module script loader.",
  "frontend/src/App.tsx": "Main React router setup handling authentication, profile/role gating, and routing to all dashboards and pages.",
  "frontend/src/components/admin/PrincipalInput.tsx": "Input component that validates principal IDs with inline error handling.",
  "frontend/src/components/alerts/AlertsBadge.tsx": "Alerts badge button showing unseen alert count and marking alerts as seen when visiting the alerts page.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that collects and saves a user's name using a mutation and shows loading or error states.",
  "frontend/src/components/auth/RolePendingScreen.tsx": "Displays an access-pending message and provides a logout option for users without an assigned role.",
  "frontend/src/components/branding/TraemeWordmark.tsx": "Renders the Traeme logo and wordmark with configurable size.",
  "frontend/src/components/dashboard/ActiveTripsPanel.tsx": "Shows a list of ongoing trips with loading states and links to the full trips page.",
  "frontend/src/components/dashboard/AlertsPreviewWidget.tsx": "Displays recent alerts filtered by route and links to the full alerts page.",
  "frontend/src/components/dashboard/AssignedRouteSummaryWidget.tsx": "Shows details for the user’s assigned route, including stops and status.",
  "frontend/src/components/dashboard/DriverTripControls.tsx": "Provides start and end trip controls for drivers based on assigned vehicle and route.",
  "frontend/src/components/dashboard/EtaSummaryWidget.tsx": "Calculates and displays ETA for the most relevant active trip and vehicle location.",
  "frontend/src/components/dashboard/GpsTrackingControls.tsx": "Enables starting and stopping GPS tracking for an assigned vehicle with status display.",
  "frontend/src/components/dashboard/PickupChecklistPanel.tsx": "Shows recent pickup/drop-off records and links to manage all records.",
  "frontend/src/components/dashboard/PickupDropoffPreviewWidget.tsx": "Displays the three most recent pickup/drop-off records with loading and empty states, linking to the full records page.",
  "frontend/src/components/dashboard/VehicleLocationWidget.tsx": "Shows real-time vehicle location details for an assigned route or first available vehicle, with loading and empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, role-based navigation, footer, and auto-redirect based on user role.",
  "frontend/src/components/navigation/RoleNav.tsx": "Renders role-specific navigation links combined with common links based on the current user's role.",
  "frontend/src/components/tracking/DriverLocationUpdater.tsx": "Form for drivers to manually update their vehicle’s latitude and longitude via mutation.",
  "frontend/src/constants/assets.ts": "Exports paths to static image assets including logo, splash background, and team member images.",
  "frontend/src/content/team.ts": "Defines team member data including id, name, role, bio, and associated images.",
  "frontend/src/hooks/queries/queryKeys.ts": "Defines reusable React Query keys for users, vehicles, routes, trips, alerts, and pickup/dropoff data.",
  "frontend/src/hooks/queries/useAlerts.ts": "Provides hooks for fetching, filtering, creating, and tracking unseen alerts with optional polling.",
  "frontend/src/hooks/queries/useCurrentUser.ts": "Fetches the current user profile and exposes helpers for checking specific user roles.",
  "frontend/src/hooks/queries/usePickupDropoff.ts": "Provides React Query hooks for fetching and mutating pickup/dropoff records using an authenticated actor.",
  "frontend/src/hooks/queries/useRoutes.ts": "Defines hooks to load, create, update, and deactivate route records with cache invalidation.",
  "frontend/src/hooks/queries/useTrips.ts": "Implements trip-related queries and mutations, including starting and ending trips and fetching active trips.",
  "frontend/src/hooks/queries/useUserProfiles.ts": "Fetches all user profiles through a simple React Query hook.",
  "frontend/src/hooks/queries/useVehicleLocations.ts": "Handles reading and updating vehicle location data with optional polling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useGpsVehicleTracking.ts": "Tracks GPS location for a vehicle, periodically updating backend state and handling errors.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication and state management.",
  "frontend/src/index.css": "Configures global Tailwind styles, themes, and fonts for the application.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission details and team member cards using data from teamMembers.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access denied message with an option to navigate back to the dashboard.",
  "frontend/src/pages/admin/AdminDriverAssignmentsPage.tsx": "Provides a form for admins to assign drivers to vehicles and routes using mutations and route data.",
  "frontend/src/pages/admin/AdminRoleManagementPage.tsx": "Lets admins assign roles to users by principal ID through a simple form and mutation flow.",
  "frontend/src/pages/admin/AdminRoutesPage.tsx": "Allows admins to create, update, and deactivate bus routes with dynamic stop management.",
  "frontend/src/pages/admin/AdminUserManagementPage.tsx": "Shows searchable user profiles with roles and assignments, linking to role and driver management pages.",
  "frontend/src/pages/AlertsPage.tsx": "Fetches and lists alerts with timestamps, marking them as seen and showing loading and empty states.",
  "frontend/src/pages/dashboards/AdminDashboard.tsx": "Admin dashboard showing user greeting, active trips, and navigation cards for admin and general features.",
  "frontend/src/pages/dashboards/DriverDashboard.tsx": "Renders the driver dashboard, showing user info and widgets for route summary, trip controls, GPS tracking, and pickup checklist.",
  "frontend/src/pages/dashboards/ParentDashboard.tsx": "Displays the parent dashboard with widgets for vehicle location, alerts, pickup/dropoff preview, and assigned route summary.",
  "frontend/src/pages/dashboards/StudentDashboard.tsx": "Shows the student dashboard with vehicle location, ETA summary, and assigned route summary widgets.",
  "frontend/src/pages/DriverProfilePage.tsx": "Shows the logged-in driver's personal and assignment information with loading and not-found handling.",
  "frontend/src/pages/GalleryPage.tsx": "Displays a grid gallery of team member photos with names and roles.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login/logout and redirects authenticated users to the parent dashboard.",
  "frontend/src/pages/PickupDropoffPage.tsx": "Lists pickup and drop-off records with status, timestamps, and student info, including loading and empty states.",
  "frontend/src/pages/RoutesPage.tsx": "Shows active routes with stop lists and provides an admin link to manage routes.",
  "frontend/src/pages/SplashScreen.tsx": "Displays a splash screen with branding and redirects authenticated users, offering navigation to login.",
  "frontend/src/pages/TrackingPage.tsx": "Shows real-time vehicle locations, allows drivers to update their location, and lists vehicles with route and timing info.",
  "frontend/src/pages/TripsPage.tsx": "Displays all trips with status, vehicle, route info, and loading states, allowing drivers/admins to edit.",
  "frontend/src/services/actorClient.ts": "Provides error handling for actor calls, mapping unauthorized errors to a user-friendly message.",
  "frontend/src/services/alertService.ts": "Wrapper functions for fetching, creating, and querying alerts through the backend actor.",
  "frontend/src/services/authService.ts": "Implements logout by clearing auth state and React Query cache.",
  "frontend/src/services/driverService.ts": "Provides a backend call to assign a driver's vehicle and route.",
  "frontend/src/services/index.ts": "Re-exports all service modules for unified access.",
  "frontend/src/services/pickupDropoffService.ts": "Functions to fetch, create, update, and query pickup/dropoff records via the backend.",
  "frontend/src/services/routeService.ts": "Service for CRUD operations and queries on routes through the backend.",
  "frontend/src/services/tripService.ts": "Backend wrappers for managing trips, including status updates and explicit start/end actions.",
  "frontend/src/services/userService.ts": "Provides user profile CRUD, role assignment, and admin checks through the backend actor.",
  "frontend/src/services/vehicleService.ts": "Backend calls to get and update vehicle location data.",
  "frontend/src/utils/eta.ts": "Calculates ETA strings based on trip status and recent vehicle location updates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Describes the project state, requirements, architecture, and implemented features for a role-based transportation app."
}